

T1x = 0.4
T2x = 4.5
T3x = 0.4
T4x = 0.9
T5x = 1.4
T6x = 3
T7x = 4.5
T8x = 6

T1y = 1.1
T2y = 1.1
T3y = 2
T4y = 3
T5y = 3.5
T6y = 4.1
T7y = 4.4
T8y = 4.6


S = (T3y-T1y)/T1y
print("S = ", S, "мА/В")


ri = (T5x-T4x)/((T5y-T4y)*10**-3)
print("ri = ", ri, "Ом")

mu = S*10**-3*ri
print("mu = ", mu)
#------------------------------------------
print("ПОЛОГА ОБЛАСТЬ")
#------------------------------------------
S2 = (T7y-T2y)/T2y
print("S = ", S2, "мА/В")

ri2 = (T8x-T6x)/((T8y-T6y)*10**-3)
print("ri = ", ri2, "Ом")

mu2 = S2*10**-3*ri2
print("mu = ", mu2)
